---
layout: post
title: 使用Redis
tags: [Redis]
bigimg: /img/path.jpg
comments: true
---

* toc
{:toc}

# 安装

获取![源代码](https://github.com/antirez/redis)

编译源代码，并测试依赖项是否完备
```
make
make test
```


# 在线尝试

http://try.redis.io/

```
> SET data:name "paofu"
OK
> GET data:name
"paofu"
> INCR conn
(integer) 1
```

```
> set lock "demo"
OK
# 设置变量的有效期
> expire lock 120
(integer) 1
# 查询变量存在的剩余时间
> ttl lock
(integer) 81
> ttl lock
(integer) -2
```

链表
```
> LLEN person
(integer) 2
> LRANGE person 0 3
1) "bob"
2) "alice"
> lpop person
"Bob"
> lpop person
"Alice"
> lpop person
(nil)
```

集合
```
> SADD conutry "china"
(integer) 1
> SADD conutry "us"
(integer) 1
> SADD conutry "japan"
(integer) 1
```

# 连接redis

打开redis服务端
```
$ cd src
$ ./redis-server
```

在另一个控制台中打开客户端
```
$ ./redis-cli
127.0.0.1:6379> ping
PONG
127.0.0.1:6379> set foo 1
OK
127.0.0.1:6379> get foo
"1"
127.0.0.1:6379> incr cnt
(integer) 1
```

# 阅读源码

## skiplist

skiplist是一种特殊的list，可以实现快速的访问一个元素。
![skiplist](http://dl2.iteye.com/upload/attachment/0098/8861/0ebae998-16af-33d5-a256-0392b26bae87.jpg)

